### CIS3120 Homework 2
- Due by April 1st 
- Submit through the blackboard link
- Submit with the notebook file (.ipynb)

1. Create a Pandas DataFrame from the following lists and set 'labels' as index of this DataFrame. (5 points)

name = ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'] <br>
score = [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19] <br>
attempts = [1, 3, 2, 3, 2, 3, 1, 1, 2, 1] <br>
qualify = ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] <br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [1]:
import pandas as pd
import numpy as np
name = ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas']
score = [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19]
attempts = [1, 3, 2, 3, 2, 3, 1, 1, 2, 1]
qualify = ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(list(zip(name, score, attempts, qualify)), columns=['name','score', 'attempts', 'qualify'])
df.index = labels
print(df)
#Expected output

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Complete the following questions based on the DataFrame you have created from the previous question (#1) (40 points)

1.1 Get the first 3 rows from the DataFrame, and save selected data in a new dataframe.  (5 points)

1.2 Select the rows where the number of attempts in the examination is less than 2 and score greater than 15. (10 points)

1.3 Find students whose score are missing (i.e. is NaN) and the number of attempts they have done. (15 points)

1.4 Find average number of attempts for qualified students and not qualified students. (10 points)

In [2]:
#1.1 Get the first 3 rows from the DataFrame, and save selected data in a new dataframe.
df2 = df.head(3)
print(df2)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [3]:
#1.2 Select the rows where the number of attempts in the examination is less than 2 and score greater than 15.
print(df[(df['attempts'] < 2) & (df['score'] > 15)])

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [4]:
#1.3 Find students whose score are missing (i.e. is NaN) and the number of attempts they have done.
print(df[df['score'].isnull() & ['attempts']])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [5]:
#1.4 Find average number of attempts for qualified students and not qualified students.
rslt_df = df[(df['qualify'] == 'no')] #create df for students that do not qualify
print("the average score for unqualified students is: ")
print(rslt_df["score"].mean()) #get mean score for unqualified students
rslt_df2 = df[(df['qualify'] == 'yes')] #create df for students that qualify
print("the average score for qualified students is: ")
print(rslt_df2["score"].mean()) #get mean score for qualified students

the average score for unqualified students is:
8.666666666666666
the average score for qualified students is:
16.5

2. Create a Pandas DataFrame with following lists. (5 points)

ord_no = [70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013] <br>
purch_amt = [150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6] <br>
ord_date = ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10',
'2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'] <br>
customer_id'= [3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001] <br>
salesman_id' = [5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan] <br>

In [6]:
ord_no = [70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013]
purch_amt = [150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6]
ord_date = ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10', '2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25']
customer_id = [3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001]
salesman_id = [5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]
df3 = pd.DataFrame(list(zip(ord_no, purch_amt, ord_date, customer_id, salesman_id)), columns=['ord_no','purch_amt', 'ord_date', 'customer_id', 'salesman_id'])
print(df3)
#Expected output

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

Complete the following questions based on the DataFrame you have created from the previous question (#2) (50 points)

2.1 Detect missing values of the DataFrame created from #2. Display True or False. (5 points)

2.2 Identify the column(s) of the DataFrame which have at least one missing value. (5 points)

2.3 Count the number of missing values in each column of the DataFrame. (5 points)

2.4 Delete the row(s) of the DataFrame which have missing values in the column 'salesman_id'; replace all NAs in the column 'ord_no' with 0; replace the NA in the column 'ord_date' with value from the previous row. (15 points)

2.5 Group the DataFrame by salesman and calculate each salesman's minimum, maximum and mean sales amount. (10 points)

2.6 Create a pivot table and find the total sale amount salesman wise and order date wise. (10 points)

In [7]:
#2.1 Detect missing values of the DataFrame created from #2. Display True or False
print(df3.isna())

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True

In [8]:
#2.2 Identify the column(s) of the DataFrame which have at least one missing value. (5 points)
print(df3.isna().any())

ord_no          True
purch_amt      False
ord_date        True
customer_id    False
salesman_id     True
dtype: bool

In [9]:
#2.3 Count the number of missing values in each column of the DataFrame. (5 points)
print(df3.isna().sum())

ord_no         4
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

In [10]:
#2.4 Delete the row(s) of the DataFrame which have missing values in the column 'salesman_id'
df3 = df3.dropna(axis=0, subset=['salesman_id'])
print(df3)

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0

In [11]:
#2.4  replace all NAs in the column 'ord_no' with 0
df3['ord_no'] = df3['ord_no'].replace(np.nan, '0')
print(df3)

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1         0     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
4         0     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6         0    5760.00  2012-09-10         3001       5001.0
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10        0      75.29  2012-08-17         3001       5003.0

In [12]:
#2.4 replace the NA in the column 'ord_date' with value from the previous row
df3['ord_date'].fillna(method='pad', inplace=True)
print(df3)

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1         0     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26  2012-09-10         3001       5001.0
4         0     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6         0    5760.00  2012-09-10         3001       5001.0
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10        0      75.29  2012-08-17         3001       5003.0

In [13]:
#2.5 Group the DataFrame by salesman and calculate each salesman's minimum, maximum and mean sales amount. (10 points)
df3.groupby(['salesman_id']).mean()
df3.groupby(['salesman_id']).max()
df3.groupby(['salesman_id']).min()

/var/folders/h8/hss13lq96dl3q2h23z2v29280000gn/T/ipykernel_44709/4253346716.py:3: FutureWarning: Dropping invalid columns in DataFrameGroupBy.max is deprecated. In a future version, a TypeError will be raised. Before calling .max, select only columns which should be valid for the function.
  df3.groupby(['salesman_id']).max()
/var/folders/h8/hss13lq96dl3q2h23z2v29280000gn/T/ipykernel_44709/4253346716.py:4: FutureWarning: Dropping invalid columns in DataFrameGroupBy.min is deprecated. In a future version, a TypeError will be raised. Before calling .min, select only columns which should be valid for the function.
  df3.groupby(['salesman_id']).min()

             purch_amt    ord_date  customer_id
salesman_id
5001.0           65.26  2012-07-27         3001
5002.0          150.50  2012-06-27         3002
5003.0           75.29  2012-08-17         3001

In [14]:
#2.6 Create a pivot table and find the total sale amount salesman wise and order date wise. (10 points)
table = pd.pivot_table(df3,index=["ord_date","salesman_id"], values="purch_amt")
print(table)

                        purch_amt
ord_date   salesman_id
2012-06-27 5002.0          250.45
2012-07-27 5001.0         2400.60
2012-08-17 5003.0           75.29
2012-09-10 5001.0         2912.63
           5002.0          948.50
           5003.0          270.65
2012-10-05 5002.0          150.50
2012-10-10 5003.0         2480.40